**Load Raw Enrolement Dataset into colab**

In [ ]:
import pandas as pd

# Load your data
df = pd.read_csv("/content/api_data_aadhar_enrolment_full.csv")

df.head(10)

,date,state,district,pincode,age_0_5,age_5_17,age_18_greater
0,02-03-2025,Meghalaya,East Khasi Hills,793121,11,61,37
1,09-03-2025,Karnataka,Bengaluru Urban,560043,14,33,39
2,09-03-2025,Uttar Pradesh,Kanpur Nagar,208001,29,82,12
3,09-03-2025,Uttar Pradesh,Aligarh,202133,62,29,15
4,09-03-2025,Karnataka,Bengaluru Urban,560016,14,16,21
5,09-03-2025,Bihar,Sitamarhi,843331,20,49,12
6,09-03-2025,Bihar,Sitamarhi,843330,23,24,42
7,09-03-2025,Uttar Pradesh,Bahraich,271865,26,60,14
8,09-03-2025,Uttar Pradesh,Firozabad,283204,28,26,10
9,09-03-2025,Bihar,Purbi Champaran,845418,30,48,10

In [ ]:
df.shape

(1006029, 7)

**Data Cleaning & EDA on State Column**

In [ ]:
# Check unique values
df['state'].unique()

array(['Meghalaya', 'Karnataka', 'Uttar Pradesh', 'Bihar', 'Maharashtra',
       'Haryana', 'Rajasthan', 'Punjab', 'Delhi', 'Madhya Pradesh',
       'West Bengal', 'Assam', 'Uttarakhand', 'Gujarat', 'Andhra Pradesh',
       'Tamil Nadu', 'Chhattisgarh', 'Jharkhand', 'Nagaland', 'Manipur',
       'Telangana', 'Tripura', 'Mizoram', 'Jammu and Kashmir',
       'Chandigarh', 'Sikkim', 'Odisha', 'Kerala',
       'The Dadra And Nagar Haveli And Daman And Diu',
       'Arunachal Pradesh', 'Himachal Pradesh', 'Goa',
       'Jammu And Kashmir', 'Dadra and Nagar Haveli and Daman and Diu',
       'Ladakh', 'Andaman and Nicobar Islands', 'Orissa', 'Pondicherry',
       'Puducherry', 'Lakshadweep', 'Andaman & Nicobar Islands',
       'Dadra & Nagar Haveli', 'Dadra and Nagar Haveli', 'Daman and Diu',
       'WEST BENGAL', 'Jammu & Kashmir', 'West  Bengal', '100000',
       'Daman & Diu', 'West Bangal', 'Westbengal', 'West bengal',
       'andhra pradesh', 'ODISHA', 'WESTBENGAL'], dtype=object)

In [ ]:
df['state'] = (
    df['state']
    .astype(str)
    .str.strip()                    # remove leading/trailing spaces
    .str.lower()                    # lowercase everything
    .str.replace('&', 'and')        # replace & with and
    .str.replace(r'\s+', ' ', regex=True)  # remove extra spaces
)

In [ ]:
state_corrections = {

    # Andhra Pradesh
    "Andhra Pradesh": "Andhra Pradesh",
    "andhra pradesh": "Andhra Pradesh",

    # Arunachal Pradesh
    "Arunachal Pradesh": "Arunachal Pradesh",

    # Assam
    "Assam": "Assam",

    # Bihar
    "Bihar": "Bihar",

    # Chhattisgarh
    "Chhattisgarh": "Chhattisgarh",
    "Chhatisgarh": "Chhattisgarh",

    # Goa
    "Goa": "Goa",

    # Gujarat
    "Gujarat": "Gujarat",

    # Haryana
    "Haryana": "Haryana",

    # Himachal Pradesh
    "Himachal Pradesh": "Himachal Pradesh",

    # Jharkhand
    "Jharkhand": "Jharkhand",

    # Karnataka
    "Karnataka": "Karnataka",

    # Kerala
    "Kerala": "Kerala",

    # Madhya Pradesh
    "Madhya Pradesh": "Madhya Pradesh",

    # Maharashtra
    "Maharashtra": "Maharashtra",

    # Manipur
    "Manipur": "Manipur",

    # Meghalaya
    "Meghalaya": "Meghalaya",

    # Mizoram
    "Mizoram": "Mizoram",

    # Nagaland
    "Nagaland": "Nagaland",

    # Odisha
    "Odisha": "Odisha",
    "Orissa": "Odisha",
    "ODISHA": "Odisha",
    "odisha": "Odisha",

    # Punjab
    "Punjab": "Punjab",

    # Rajasthan
    "Rajasthan": "Rajasthan",

    # Sikkim
    "Sikkim": "Sikkim",

    # Tamil Nadu
    "Tamil Nadu": "Tamil Nadu",
    "Tamilnadu": "Tamil Nadu",

    # Telangana
    "Telangana": "Telangana",

    # Tripura
    "Tripura": "Tripura",

    # Uttar Pradesh
    "Uttar Pradesh": "Uttar Pradesh",

    # Uttarakhand
    "Uttarakhand": "Uttarakhand",
    "Uttaranchal": "Uttarakhand",

    # West Bengal
    "West Bengal": "West Bengal",
    "WESTBENGAL": "West Bengal",
    "Westbengal": "West Bengal",
    "West  Bengal": "West Bengal",
    "WEST BENGAL": "West Bengal",
    "West Bangal": "West Bengal",
    "West bengal": "West Bengal",
    "west Bengal": "West Bengal",

    # --------------------
    # UNION TERRITORIES
    # --------------------

    # Andaman & Nicobar Islands
    "Andaman and Nicobar Islands": "Andaman and Nicobar Islands",
    "Andaman & Nicobar Islands": "Andaman and Nicobar Islands",

    # Chandigarh
    "Chandigarh": "Chandigarh",

    # Dadra & Nagar Haveli and Daman & Diu
    "Dadra and Nagar Haveli and Daman and Diu": "Dadra and Nagar Haveli and Daman and Diu",
    "Dadra and Nagar Haveli": "Dadra and Nagar Haveli and Daman and Diu",
    "Dadra & Nagar Haveli": "Dadra and Nagar Haveli and Daman and Diu",
    "Daman and Diu": "Dadra and Nagar Haveli and Daman and Diu",
    "Daman & Diu": "Dadra and Nagar Haveli and Daman and Diu",

    # Delhi
    "Delhi": "Delhi",

    # Jammu & Kashmir
    "Jammu and Kashmir": "Jammu and Kashmir",
    "Jammu & Kashmir": "Jammu and Kashmir",

    # Ladakh
    "Ladakh": "Ladakh",

    # Lakshadweep
    "Lakshadweep": "Lakshadweep",

    # Puducherry
    "Puducherry": "Puducherry",
    "Pondicherry": "Puducherry"
}

In [ ]:
df['state'] = df['state'].replace(state_corrections)

In [ ]:
df['state'] = df['state'].str.title()

In [ ]:
df['state'].unique()

array(['Meghalaya', 'Karnataka', 'Uttar Pradesh', 'Bihar', 'Maharashtra',
       'Haryana', 'Rajasthan', 'Punjab', 'Delhi', 'Madhya Pradesh',
       'West Bengal', 'Assam', 'Uttarakhand', 'Gujarat', 'Andhra Pradesh',
       'Tamil Nadu', 'Chhattisgarh', 'Jharkhand', 'Nagaland', 'Manipur',
       'Telangana', 'Tripura', 'Mizoram', 'Jammu And Kashmir',
       'Chandigarh', 'Sikkim', 'Odisha', 'Kerala',
       'The Dadra And Nagar Haveli And Daman And Diu',
       'Arunachal Pradesh', 'Himachal Pradesh', 'Goa',
       'Dadra And Nagar Haveli And Daman And Diu', 'Ladakh',
       'Andaman And Nicobar Islands', 'Puducherry', 'Lakshadweep',
       'Dadra And Nagar Haveli', 'Daman And Diu', '100000'], dtype=object)

In [ ]:
# Final standardization mapping
final_state_map = {
    'The Dadra And Nagar Haveli And Daman And Diu':
        'Dadra And Nagar Haveli And Daman And Diu',
    'Dadra And Nagar Haveli':
        'Dadra And Nagar Haveli And Daman And Diu',
    'Daman And Diu':
        'Dadra And Nagar Haveli And Daman And Diu'
}

df['state'] = df['state'].replace(final_state_map)

In [ ]:
df['state'].nunique()

36

In [ ]:
df = df[df['state'] != '100000']

In [ ]:
official_states = [
    'Andhra Pradesh','Arunachal Pradesh','Assam','Bihar','Chhattisgarh',
    'Goa','Gujarat','Haryana','Himachal Pradesh','Jharkhand','Karnataka',
    'Kerala','Madhya Pradesh','Maharashtra','Manipur','Meghalaya',
    'Mizoram','Nagaland','Odisha','Punjab','Rajasthan','Sikkim',
    'Tamil Nadu','Telangana','Tripura','Uttar Pradesh','Uttarakhand',
    'West Bengal','Andaman And Nicobar Islands','Chandigarh',
    'Dadra And Nagar Haveli And Daman And Diu','Delhi','Jammu And Kashmir',
    'Ladakh','Lakshadweep','Puducherry'
]

# Find unexpected values
set(df['state'].unique()) - set(official_states)

set()

**Understand Raw data**

In [ ]:
df.shape

(1006007, 7)

In [ ]:
df.isnull().sum()

date              0
state             0
district          0
pincode           0
age_0_5           0
age_5_17          0
age_18_greater    0
dtype: int64

**Data Cleaning & EDA on Pincode Column**

In [ ]:
df['pincode'].head()

0    793121
1    560043
2    208001
3    202133
4    560016
Name: pincode, dtype: int64

In [ ]:
df['pincode'].dtype

dtype('int64')

In [ ]:
df['pincode'].isnull().sum()

np.int64(0)

In [ ]:
df['pincode'] = df['pincode'].astype(str).str.strip()

In [ ]:
df = df[df['pincode'].str.match(r'^\d+$')]

In [ ]:
df = df[df['pincode'].str.len() == 6]

In [ ]:
invalid_pins = ['000000', '111111', '999999']
df = df[~df['pincode'].isin(invalid_pins)]

In [ ]:
# Unique pincodes count
df['pincode'].nunique()

19462

In [ ]:
# Check min & max (sanity check)
df['pincode'].astype(int).describe()

count    1.006007e+06
mean     5.186506e+05
std      2.056289e+05
min      1.100010e+05
25%      3.636410e+05
50%      5.174170e+05
75%      7.001040e+05
max      8.554560e+05
Name: pincode, dtype: float64

In [ ]:
df.shape

(1006007, 7)

In [ ]:
df['pincode'] = df['pincode'].astype(str)

**Added New Column pincode_first_digit to Derive Zone Column From Pincode**

In [ ]:
df['pincode_first_digit'] = df['pincode'].str[0]

In [ ]:
df['pincode_first_digit'].unique()

array(['7', '5', '2', '8', '4', '1', '3', '6'], dtype=object)

In [ ]:
df['pincode'].astype(str).str.len().value_counts()

pincode
6    1006007
Name: count, dtype: int64

In [ ]:
df['pincode'].astype(str).str[0].value_counts().sort_index()

pincode
1     66267
2    120313
3    103199
4    147493
5    178707
6    133643
7    172600
8     83785
Name: count, dtype: int64

In [ ]:
df['pincode'].value_counts().head(10)

pincode
500055    274
500018    267
500005    247
110053    219
431001    216
743329    214
244102    211
831002    207
713143    202
853204    198
Name: count, dtype: int64

In [ ]:
df[df['pincode'].astype(str).str.match(r'^0{6}$')]

Empty DataFrame
Columns: [date, state, district, pincode, age_0_5, age_5_17, age_18_greater, pincode_first_digit]
Index: []

In [ ]:
df.groupby('state')['pincode'].nunique().sort_values(ascending=False)

state
Tamil Nadu                                  2064
Andhra Pradesh                              1786
Uttar Pradesh                               1737
Maharashtra                                 1580
Kerala                                      1403
West Bengal                                 1336
Karnataka                                   1336
Gujarat                                     1020
Rajasthan                                    978
Odisha                                       909
Bihar                                        906
Madhya Pradesh                               787
Telangana                                    647
Assam                                        571
Punjab                                       521
Himachal Pradesh                             442
Jharkhand                                    359
Haryana                                      300
Uttarakhand                                  290
Chhattisgarh                                 264
Jammu And Kashmir                            202
Delhi                                         93
Tripura                                       86
Goa                                           85
Meghalaya                                     67
Manipur                                       54
Arunachal Pradesh                             52
Mizoram                                       47
Nagaland                                      44
Puducherry                                    35
Chandigarh                                    24
Sikkim                                        22
Andaman And Nicobar Islands                   21
Ladakh                                        13
Dadra And Nagar Haveli And Daman And Diu      10
Lakshadweep                                    9
Name: pincode, dtype: int64

In [ ]:
df.duplicated(subset=['pincode']).sum()

np.int64(986545)

In [ ]:
df['pincode'].astype(int).describe()

count    1.006007e+06
mean     5.186506e+05
std      2.056289e+05
min      1.100010e+05
25%      3.636410e+05
50%      5.174170e+05
75%      7.001040e+05
max      8.554560e+05
Name: pincode, dtype: float64

In [ ]:
df.shape

(1006007, 8)

**Zone Column Derived From Pincode**

In [ ]:
df['zone'] = 'Unknown'

df.loc[df['pincode_first_digit'].isin(['1', '2']), 'zone'] = 'North'
df.loc[df['pincode_first_digit'].isin(['3', '4']), 'zone'] = 'West'
df.loc[df['pincode_first_digit'].isin(['5', '6']), 'zone'] = 'South'
df.loc[df['pincode_first_digit'].isin(['7', '8']), 'zone'] = 'East'
df.loc[df['pincode_first_digit'] == '9', 'zone'] = 'Other'

In [ ]:
df[['pincode_first_digit', 'zone']].value_counts().head(10)

pincode_first_digit  zone
5                    South    178707
7                    East     172600
4                    West     147493
6                    South    133643
2                    North    120313
3                    West     103199
8                    East      83785
1                    North     66267
Name: count, dtype: int64

In [ ]:
df['zone'].value_counts()

zone
South    312350
East     256385
West     250692
North    186580
Name: count, dtype: int64

In [ ]:
df.shape

(1006007, 9)

**Data Cleaning & EDA on Date Column**

In [ ]:
df['date'].isnull().sum()

np.int64(0)

In [ ]:
df['date_dt'] = pd.to_datetime(
    df['date'],
    dayfirst=True,
    errors='coerce'
)

In [ ]:
df['date_dt'].isnull().sum()

np.int64(0)

In [ ]:
df.head()

,date,state,district,pincode,age_0_5,age_5_17,age_18_greater,pincode_first_digit,zone,date_dt
0,02-03-2025,Meghalaya,East Khasi Hills,793121,11,61,37,7,East,2025-03-02
1,09-03-2025,Karnataka,Bengaluru Urban,560043,14,33,39,5,South,2025-03-09
2,09-03-2025,Uttar Pradesh,Kanpur Nagar,208001,29,82,12,2,North,2025-03-09
3,09-03-2025,Uttar Pradesh,Aligarh,202133,62,29,15,2,North,2025-03-09
4,09-03-2025,Karnataka,Bengaluru Urban,560016,14,16,21,5,South,2025-03-09

**Derived Year, Month, Month Name, Day Name, Week From Date Column**

In [ ]:
df['year'] = df['date_dt'].dt.year

In [ ]:
df['year'].value_counts().sort_index()

year
2025    1006007
Name: count, dtype: int64

In [ ]:
df['month'] = df['date_dt'].dt.month
df['month_name'] = df['date_dt'].dt.month_name()
df['day_name'] = df['date_dt'].dt.day_name()
df['week'] = df['date_dt'].dt.isocalendar().week

In [ ]:
df.head()

,date,state,district,pincode,age_0_5,age_5_17,age_18_greater,pincode_first_digit,zone,date_dt,year,month,month_name,day_name,week
0,02-03-2025,Meghalaya,East Khasi Hills,793121,11,61,37,7,East,2025-03-02,2025,3,March,Sunday,9
1,09-03-2025,Karnataka,Bengaluru Urban,560043,14,33,39,5,South,2025-03-09,2025,3,March,Sunday,10
2,09-03-2025,Uttar Pradesh,Kanpur Nagar,208001,29,82,12,2,North,2025-03-09,2025,3,March,Sunday,10
3,09-03-2025,Uttar Pradesh,Aligarh,202133,62,29,15,2,North,2025-03-09,2025,3,March,Sunday,10
4,09-03-2025,Karnataka,Bengaluru Urban,560016,14,16,21,5,South,2025-03-09,2025,3,March,Sunday,10

**Enrolement Updates Per Month**

In [ ]:
df['month_name'].value_counts().reindex([
    'January','February','March','April','May','June',
    'July','August','September','October','November','December'
])

month_name
January           NaN
February          NaN
March           168.0
April           847.0
May             549.0
June            582.0
July           1184.0
August            NaN
September    356051.0
October      211882.0
November     272787.0
December     161957.0
Name: count, dtype: float64

In [ ]:
month_order = [
    'January','February','March','April','May','June',
    'July','August','September','October','November','December'
]

month_counts = (
    df['month_name']
    .value_counts()
    .reindex(month_order, fill_value=0)
)

month_counts

month_name
January           0
February          0
March           168
April           847
May             549
June            582
July           1184
August            0
September    356051
October      211882
November     272787
December     161957
Name: count, dtype: int64

**Enrolement Updates Per Day**

In [ ]:
df['day_name'].value_counts().reindex([
    'Monday','Tuesday','Wednesday','Thursday',
    'Friday','Saturday','Sunday'
])

day_name
Monday       189083
Tuesday      142259
Wednesday    165235
Thursday     130090
Friday       138015
Saturday     131093
Sunday       110232
Name: count, dtype: int64

In [ ]:
df.groupby(df['date_dt'].dt.to_period('M')).size()

date_dt
2025-03       168
2025-04       847
2025-05       549
2025-06       582
2025-07      1184
2025-09    356051
2025-10    211882
2025-11    272787
2025-12    161957
Freq: M, dtype: int64

In [ ]:
df = df.drop(columns=['pincode_first_digit'])

In [ ]:
df.head()

,date,state,district,pincode,age_0_5,age_5_17,age_18_greater,zone,date_dt,year,month,month_name,day_name,week
0,02-03-2025,Meghalaya,East Khasi Hills,793121,11,61,37,East,2025-03-02,2025,3,March,Sunday,9
1,09-03-2025,Karnataka,Bengaluru Urban,560043,14,33,39,South,2025-03-09,2025,3,March,Sunday,10
2,09-03-2025,Uttar Pradesh,Kanpur Nagar,208001,29,82,12,North,2025-03-09,2025,3,March,Sunday,10
3,09-03-2025,Uttar Pradesh,Aligarh,202133,62,29,15,North,2025-03-09,2025,3,March,Sunday,10
4,09-03-2025,Karnataka,Bengaluru Urban,560016,14,16,21,South,2025-03-09,2025,3,March,Sunday,10

**Data Cleaning & EDA on District Column**

In [ ]:
df['district'].dtype

dtype('O')

In [ ]:
df['district'].isnull().sum()

np.int64(0)

In [ ]:
df['district'].nunique()

984

In [ ]:
df['district_clean'] = df['district']

In [ ]:
df['state_correct'] = df['state']

In [ ]:
df.head()

,date,state,district,pincode,age_0_5,age_5_17,age_18_greater,zone,date_dt,year,month,month_name,day_name,week,district_clean,state_correct
0,02-03-2025,Meghalaya,East Khasi Hills,793121,11,61,37,East,2025-03-02,2025,3,March,Sunday,9,East Khasi Hills,Meghalaya
1,09-03-2025,Karnataka,Bengaluru Urban,560043,14,33,39,South,2025-03-09,2025,3,March,Sunday,10,Bengaluru Urban,Karnataka
2,09-03-2025,Uttar Pradesh,Kanpur Nagar,208001,29,82,12,North,2025-03-09,2025,3,March,Sunday,10,Kanpur Nagar,Uttar Pradesh
3,09-03-2025,Uttar Pradesh,Aligarh,202133,62,29,15,North,2025-03-09,2025,3,March,Sunday,10,Aligarh,Uttar Pradesh
4,09-03-2025,Karnataka,Bengaluru Urban,560016,14,16,21,South,2025-03-09,2025,3,March,Sunday,10,Bengaluru Urban,Karnataka

In [ ]:
df['state'].unique()

array(['Meghalaya', 'Karnataka', 'Uttar Pradesh', 'Bihar', 'Maharashtra',
       'Haryana', 'Rajasthan', 'Punjab', 'Delhi', 'Madhya Pradesh',
       'West Bengal', 'Assam', 'Uttarakhand', 'Gujarat', 'Andhra Pradesh',
       'Tamil Nadu', 'Chhattisgarh', 'Jharkhand', 'Nagaland', 'Manipur',
       'Telangana', 'Tripura', 'Mizoram', 'Jammu And Kashmir',
       'Chandigarh', 'Sikkim', 'Odisha', 'Kerala',
       'Dadra And Nagar Haveli And Daman And Diu', 'Arunachal Pradesh',
       'Himachal Pradesh', 'Goa', 'Ladakh', 'Andaman And Nicobar Islands',
       'Puducherry', 'Lakshadweep'], dtype=object)

**Clean District From Deriving Data From Main Table Per State and Than Clean District and than Update back to Main Table**

In [ ]:
df_L = df[df['state'] == 'Puducherry']
df_L.head()

,date,state,district,pincode,age_0_5,age_5_17,age_18_greater,zone,date_dt,year,month,month_name,day_name,week,district_clean,state_correct
5218,01-09-2025,Puducherry,Pondicherry,605001,2,0,0,South,2025-09-01,2025,9,September,Monday,36,Pondicherry,Puducherry
5219,01-09-2025,Puducherry,Pondicherry,605008,1,0,0,South,2025-09-01,2025,9,September,Monday,36,Pondicherry,Puducherry
5220,01-09-2025,Puducherry,Karaikal,609602,2,0,0,South,2025-09-01,2025,9,September,Monday,36,Karaikal,Puducherry
5221,01-09-2025,Puducherry,Karaikal,609603,1,0,0,South,2025-09-01,2025,9,September,Monday,36,Karaikal,Puducherry
5222,01-09-2025,Puducherry,Karaikal,609606,2,0,0,South,2025-09-01,2025,9,September,Monday,36,Karaikal,Puducherry

In [ ]:
df_L.shape

(18550, 16)

In [ ]:
df_L['district_clean'] = df_L['district']
df_L['district_clean'].unique()

/tmp/ipython-input-1478444784.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_L['district_clean'] = df_L['district']

array(['Pondicherry', 'Karaikal', 'Puducherry', 'Yanam'], dtype=object)

In [ ]:
L_mapping = {
    'Pondicherry': 'Puducherry',   # old / colonial name
    'Puducherry': 'Puducherry',
    'Karaikal': 'Karaikal',
    'Yanam': 'Yanam'
}

In [ ]:
df_L['district_clean'] = (
    df_L['district_clean']
    .replace(L_mapping)
)

/tmp/ipython-input-1503597074.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_L['district_clean'] = (

In [ ]:
df_L['district_clean'].unique()

array(['Hyderabad', 'Rangareddy', 'Medchal-Malkajgiri',
       'Bhadradri Kothagudem', 'Mahabubnagar', 'Mahbubnagar', 'Medak',
       'Nalgonda', 'Warangal', 'Adilabad', 'Karimnagar', 'Khammam',
       'Hanumakonda', 'Jagtial', 'Jangaon', 'Jayashankar Bhupalpally',
       'Jogulamba Gadwal', 'Kamareddy', 'Komaram Bheem', 'Mahabubabad',
       'Mancherial', 'Mulugu', 'Nagarkurnool', 'Narayanpet', 'Nirmal',
       'Nizamabad', 'Peddapalli', 'Rajanna Sircilla', 'Sangareddy',
       'Siddipet', 'Suryapet', 'Vikarabad', 'Wanaparthy',
       'Yadadri Bhuvanagiri'], dtype=object)

In [ ]:
df_L['district_clean'].nunique()

3

In [ ]:
df.shape

(1006007, 16)

In [ ]:
mask = df['state'] == 'Puducherry'
df.loc[mask, 'district'] = df_L['district_clean'].values

In [ ]:
df.shape

(1006007, 16)

In [ ]:
df.head()

,date,state,district,pincode,age_0_5,age_5_17,age_18_greater,zone,date_dt,year,month,month_name,day_name,week,district_clean,state_correct
0,02-03-2025,Meghalaya,East Khasi Hills,793121,11,61,37,East,2025-03-02,2025,3,March,Sunday,9,East Khasi Hills,Meghalaya
1,09-03-2025,Karnataka,Bengaluru Urban,560043,14,33,39,South,2025-03-09,2025,3,March,Sunday,10,Bengaluru Urban,Karnataka
2,09-03-2025,Uttar Pradesh,Kanpur Nagar,208001,29,82,12,North,2025-03-09,2025,3,March,Sunday,10,Kanpur Nagar,Uttar Pradesh
3,09-03-2025,Uttar Pradesh,Aligarh,202133,62,29,15,North,2025-03-09,2025,3,March,Sunday,10,Aligarh,Uttar Pradesh
4,09-03-2025,Karnataka,Bengaluru Urban,560016,14,16,21,South,2025-03-09,2025,3,March,Sunday,10,Bengaluru Urban,Karnataka

In [ ]:
df[df['state'] == 'Jammu And Kashmir']['district'].nunique()

20

**Clean District That Present in Wrong State**

In [ ]:
Tamilnadu_districts_raw = [
     'Leh',
    'Kargil',
    'Leh (ladakh)'
]

In [ ]:
mask = (
    df['district_clean'].isin(Tamilnadu_districts_raw) &
    (df['state'] == 'Jammu And Kashmir')
)

df.loc[mask, 'state'] = 'Ladakh'

In [ ]:
df = df[df['district'].str.strip() != '?']

In [ ]:
df['state'].nunique()
#df['state_correct'].nunique()

36

In [ ]:
df['district'].nunique()
#df['district_clean'].nunique()

763

In [ ]:
df = df.drop(columns=['state_correct', 'district_clean'])

In [ ]:
df.head()

,date,state,district,pincode,age_0_5,age_5_17,age_18_greater,zone,date_dt,year,month,month_name,day_name,week
0,02-03-2025,Meghalaya,East Khasi Hills,793121,11,61,37,East,2025-03-02,2025,3,March,Sunday,9
1,09-03-2025,Karnataka,Bengaluru Urban,560043,14,33,39,South,2025-03-09,2025,3,March,Sunday,10
2,09-03-2025,Uttar Pradesh,Kanpur Nagar,208001,29,82,12,North,2025-03-09,2025,3,March,Sunday,10
3,09-03-2025,Uttar Pradesh,Aligarh,202133,62,29,15,North,2025-03-09,2025,3,March,Sunday,10
4,09-03-2025,Karnataka,Bengaluru Urban,560016,14,16,21,South,2025-03-09,2025,3,March,Sunday,10

In [ ]:
df.groupby('state')['district'].nunique().sort_values(ascending=False)

state
Uttar Pradesh                               75
Madhya Pradesh                              55
Rajasthan                                   39
Bihar                                       38
Tamil Nadu                                  38
Maharashtra                                 37
Assam                                       35
Gujarat                                     33
Telangana                                   33
Chhattisgarh                                33
Karnataka                                   31
Odisha                                      30
Andhra Pradesh                              26
Arunachal Pradesh                           25
Jharkhand                                   24
West Bengal                                 23
Punjab                                      23
Haryana                                     22
Jammu And Kashmir                           20
Nagaland                                    16
Kerala                                      14
Uttarakhand                                 13
Himachal Pradesh                            12
Meghalaya                                   12
Manipur                                     12
Mizoram                                     11
Delhi                                       11
Tripura                                      8
Sikkim                                       4
Andaman And Nicobar Islands                  3
Dadra And Nagar Haveli And Daman And Diu     3
Puducherry                                   3
Goa                                          2
Ladakh                                       2
Lakshadweep                                  1
Chandigarh                                   1
Name: district, dtype: int64

In [ ]:
df['district'].value_counts().head(10)

district
Bengaluru Urban      9031
Purba Bardhaman      8266
North 24 Parganas    7601
Belagavi             7058
Pune                 6663
South 24 Parganas    6106
Viluppuram           6044
Anantapur            5958
Ranga Reddy          5909
Purba Medinipur      5475
Name: count, dtype: int64

In [ ]:
df['district'].value_counts().tail(10)

district
Dibang Valley       9
Saitual             8
Pherzawl            6
Pakke Kessang       4
Leparada            3
Hnahthial           2
Didwana-Kuchaman    2
Balotra             1
Salumbar            1
Beawar              1
Name: count, dtype: int64

In [ ]:
top10 = df['district'].value_counts().head(10)
(top10 / len(df)) * 100

district
Bengaluru Urban      0.897707
Purba Bardhaman      0.821664
North 24 Parganas    0.755561
Belagavi             0.701586
Pune                 0.662321
South 24 Parganas    0.606954
Viluppuram           0.600791
Anantapur            0.592242
Ranga Reddy          0.587372
Purba Medinipur      0.544231
Name: count, dtype: float64

In [ ]:
df.groupby('zone')['district'].nunique()

zone
East     241
North    178
South    146
West     201
Name: district, dtype: int64

In [ ]:
df.head()

,date,state,district,pincode,age_0_5,age_5_17,age_18_greater,zone,date_dt,year,month,month_name,day_name,week
0,02-03-2025,Meghalaya,East Khasi Hills,793121,11,61,37,East,2025-03-02,2025,3,March,Sunday,9
1,09-03-2025,Karnataka,Bengaluru Urban,560043,14,33,39,South,2025-03-09,2025,3,March,Sunday,10
2,09-03-2025,Uttar Pradesh,Kanpur Nagar,208001,29,82,12,North,2025-03-09,2025,3,March,Sunday,10
3,09-03-2025,Uttar Pradesh,Aligarh,202133,62,29,15,North,2025-03-09,2025,3,March,Sunday,10
4,09-03-2025,Karnataka,Bengaluru Urban,560016,14,16,21,South,2025-03-09,2025,3,March,Sunday,10

**Data Cleaning & EDA on age_0_5 Column**

In [ ]:
df['age_0_5'].dtype

dtype('int64')

In [ ]:
df['age_0_5'].isnull().sum()

np.int64(0)

In [ ]:
(df['age_0_5'] < 0).sum()

np.int64(0)

In [ ]:
df['age_0_5'].describe()

count    1.006007e+06
mean     3.525786e+00
std      1.753870e+01
min      0.000000e+00
25%      1.000000e+00
50%      2.000000e+00
75%      3.000000e+00
max      2.688000e+03
Name: age_0_5, dtype: float64

In [ ]:
df.groupby('state')['age_0_5'].sum() \
  .sort_values(ascending=False)

state
Uttar Pradesh                               521045
Madhya Pradesh                              367990
Maharashtra                                 278814
West Bengal                                 275420
Bihar                                       262875
Rajasthan                                   229780
Gujarat                                     193031
Tamil Nadu                                  182313
Karnataka                                   179262
Assam                                       141248
Telangana                                   118962
Odisha                                       99431
Andhra Pradesh                               99401
Jharkhand                                    98551
Haryana                                      88042
Chhattisgarh                                 82453
Delhi                                        69183
Punjab                                       61227
Kerala                                       53737
Jammu And Kashmir                            39985
Uttarakhand                                  31880
Meghalaya                                    21166
Himachal Pradesh                             16639
Tripura                                       7376
Manipur                                       5140
Nagaland                                      4512
Mizoram                                       4136
Puducherry                                    2778
Chandigarh                                    2473
Arunachal Pradesh                             1957
Goa                                           1916
Dadra And Nagar Haveli And Daman And Diu      1497
Sikkim                                        1054
Ladakh                                        1020
Andaman And Nicobar Islands                    479
Lakshadweep                                    192
Name: age_0_5, dtype: int64

In [ ]:
df.groupby('district')['age_0_5'].sum() \
  .sort_values(ascending=False).head(15)

district
Bengaluru Urban      38343
Murshidabad          31442
Thane                29092
South 24 Parganas    28384
North 24 Parganas    25920
Uttar Dinajpur       25138
Pune                 24088
Hyderabad            23552
Jaipur               21436
Sitamarhi            20679
Surat                18412
Bareilly             17187
Ahmedabad            16949
Purba Bardhaman      16686
Indore               16685
Name: age_0_5, dtype: int64

In [ ]:
(df['age_0_5'] == 0).sum()

np.int64(115221)

In [ ]:
df['age_0_5'].min()
df['age_0_5'].max()

2688

**Data Cleaning & EDA on age_5_17 Column**

In [ ]:
df['age_5_17'].dtype

dtype('int64')

In [ ]:
df['age_5_17'].isnull().sum()

np.int64(0)

In [ ]:
(df['age_5_17'] < 0).sum()

np.int64(0)

In [ ]:
df['age_5_17'].describe()

count    1.006007e+06
mean     1.710110e+00
std      1.436978e+01
min      0.000000e+00
25%      0.000000e+00
50%      0.000000e+00
75%      1.000000e+00
max      1.812000e+03
Name: age_5_17, dtype: float64

In [ ]:
df.groupby('district')['age_5_17'].sum() \
  .sort_values(ascending=False).head(15)

district
West Champaran      28807
East Champaran      28508
Bahraich            22360
Gaya                20244
Sitamarhi           18856
Patna               17151
Saran               16407
Bengaluru Urban     15318
East Khasi Hills    14606
Muzaffarpur         14103
Sitapur             13869
Thane               13629
Azamgarh            13577
Varanasi            13404
Uttar Dinajpur      13065
Name: age_5_17, dtype: int64

In [ ]:
df.groupby('state')['age_5_17'].sum() \
  .sort_values(ascending=False)

state
Uttar Pradesh                               479682
Bihar                                       334802
Madhya Pradesh                              116381
Rajasthan                                   113123
West Bengal                                  91410
Maharashtra                                  82116
Gujarat                                      71182
Assam                                        66156
Jharkhand                                    57539
Meghalaya                                    53234
Tamil Nadu                                   37227
Karnataka                                    33863
Telangana                                    27959
Odisha                                       22817
Delhi                                        22296
Chhattisgarh                                 18769
Kerala                                       18590
Punjab                                       12350
Andhra Pradesh                               10292
Nagaland                                      9953
Haryana                                       9110
Manipur                                       8053
Jammu And Kashmir                             7839
Uttarakhand                                   5479
Tripura                                       3654
Arunachal Pradesh                             2236
Mizoram                                       1295
Sikkim                                        1047
Himachal Pradesh                               661
Ladakh                                         316
Goa                                            254
Dadra And Nagar Haveli And Daman And Diu       250
Chandigarh                                     211
Puducherry                                     195
Andaman And Nicobar Islands                     32
Lakshadweep                                     10
Name: age_5_17, dtype: int64

**Data Cleaning & EDA on age_18_greater Column**

In [ ]:
df['age_18_greater'].dtype

dtype('int64')

In [ ]:
df['age_18_greater'].isnull().sum()

np.int64(0)

In [ ]:
(df['age_18_greater'] < 0).sum()

np.int64(0)

In [ ]:
df['age_18_greater'].describe()

count    1.006007e+06
mean     1.671320e-01
std      3.216535e+00
min      0.000000e+00
25%      0.000000e+00
50%      0.000000e+00
75%      0.000000e+00
max      8.550000e+02
Name: age_18_greater, dtype: float64

In [ ]:
df.groupby('district')['age_18_greater'].sum() \
  .sort_values(ascending=False).head(15)

district
East Khasi Hills      9948
Bengaluru Urban       7612
West Khasi Hills      5310
West Garo Hills       4540
West Jaintia Hills    3798
Ri Bhoi               3372
Sitamarhi             2697
Banaskantha           2417
Bahraich              2304
Dahod                 1947
Golaghat              1921
North 24 Parganas     1862
East Jaintia Hills    1796
East Garo Hills       1674
Tinsukia              1633
Name: age_18_greater, dtype: int64

In [ ]:
df.groupby('state')['age_18_greater'].sum() \
  .sort_values(ascending=False)

state
Meghalaya                                   35228
Assam                                       22936
Uttar Pradesh                               17902
Gujarat                                     16336
Bihar                                       11908
Karnataka                                   10110
Madhya Pradesh                               9599
West Bengal                                  8510
Maharashtra                                  8209
Rajasthan                                    5555
Punjab                                       3172
Delhi                                        3050
Kerala                                       2675
Chhattisgarh                                 1997
Andhra Pradesh                               1492
Jharkhand                                    1449
Tamil Nadu                                   1249
Telangana                                    1154
Nagaland                                     1122
Haryana                                      1100
Odisha                                        739
Jammu And Kashmir                             533
Mizoram                                       495
Uttarakhand                                   339
Manipur                                       263
Tripura                                       255
Himachal Pradesh                              186
Goa                                           163
Arunachal Pradesh                             151
Sikkim                                        106
Dadra And Nagar Haveli And Daman And Diu       52
Puducherry                                     44
Chandigarh                                     36
Ladakh                                         20
Lakshadweep                                     1
Andaman And Nicobar Islands                     0
Name: age_18_greater, dtype: int64

In [ ]:
df.shape

(1006007, 14)

In [ ]:
df.head()

,date,state,district,pincode,age_0_5,age_5_17,age_18_greater,zone,date_dt,year,month,month_name,day_name,week
0,02-03-2025,Meghalaya,East Khasi Hills,793121,11,61,37,East,2025-03-02,2025,3,March,Sunday,9
1,09-03-2025,Karnataka,Bengaluru Urban,560043,14,33,39,South,2025-03-09,2025,3,March,Sunday,10
2,09-03-2025,Uttar Pradesh,Kanpur Nagar,208001,29,82,12,North,2025-03-09,2025,3,March,Sunday,10
3,09-03-2025,Uttar Pradesh,Aligarh,202133,62,29,15,North,2025-03-09,2025,3,March,Sunday,10
4,09-03-2025,Karnataka,Bengaluru Urban,560016,14,16,21,South,2025-03-09,2025,3,March,Sunday,10

**Reorder Columns For Easy Data Understanding**

In [ ]:
df = df[
    [
        'date',
        'date_dt',
        'year',
        'week',
        'month',
        'month_name',
        'day_name',
        'state',
        'district',
        'pincode',
        'zone',
        'age_0_5',
        'age_5_17',
        'age_18_greater'
    ]
]

In [ ]:
df.head()

,date,date_dt,year,week,month,month_name,day_name,state,district,pincode,zone,age_0_5,age_5_17,age_18_greater
0,02-03-2025,2025-03-02,2025,9,3,March,Sunday,Meghalaya,East Khasi Hills,793121,East,11,61,37
1,09-03-2025,2025-03-09,2025,10,3,March,Sunday,Karnataka,Bengaluru Urban,560043,South,14,33,39
2,09-03-2025,2025-03-09,2025,10,3,March,Sunday,Uttar Pradesh,Kanpur Nagar,208001,North,29,82,12
3,09-03-2025,2025-03-09,2025,10,3,March,Sunday,Uttar Pradesh,Aligarh,202133,North,62,29,15
4,09-03-2025,2025-03-09,2025,10,3,March,Sunday,Karnataka,Bengaluru Urban,560016,South,14,16,21

In [ ]:
df.shape

(1006007, 14)

In [ ]:
filtered_df = df[
    (df['age_0_5'] == 0) &
    (df['age_5_17'] == 0) &
    (df['age_18_greater'] == 0)
]

In [ ]:
len(filtered_df)

0

In [ ]:
df.shape

(1006007, 14)

In [ ]:
df.head()

,date,date_dt,year,week,month,month_name,day_name,state,district,pincode,zone,age_0_5,age_5_17,age_18_greater
0,02-03-2025,2025-03-02,2025,9,3,March,Sunday,Meghalaya,East Khasi Hills,793121,East,11,61,37
1,09-03-2025,2025-03-09,2025,10,3,March,Sunday,Karnataka,Bengaluru Urban,560043,South,14,33,39
2,09-03-2025,2025-03-09,2025,10,3,March,Sunday,Uttar Pradesh,Kanpur Nagar,208001,North,29,82,12
3,09-03-2025,2025-03-09,2025,10,3,March,Sunday,Uttar Pradesh,Aligarh,202133,North,62,29,15
4,09-03-2025,2025-03-09,2025,10,3,March,Sunday,Karnataka,Bengaluru Urban,560016,South,14,16,21

**Derive New Columns minor_services & Adult_services For Data Uniformity**

In [ ]:
df['minor_services'] = df['age_0_5'] + df['age_5_17']
df['adult_services'] = df['age_18_greater']

**Derived column for Total Enrolement Activity**

In [ ]:
df['total_activity'] = df['minor_services'] + df['adult_services']

**Add Updates back to Enrolement Dataset**

In [ ]:
df.to_csv(
    "/content/api_data_aadhar_enrolement_v1_cleaned.csv",
    index=False
)